class_name: Sequential
config:
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    batch_input_shape: !!python/tuple [null, 1, 2, 128]
    border_mode: same
    dim_ordering: th
    init: glorot_uniform
    input_dtype: float32
    name: convolution2d_1
    nb_col: 8
    nb_filter: 64
    nb_row: 2
    subsample: !!python/tuple [1, 1]
    trainable: true
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_1
    pool_size: &id001 !!python/tuple [1, 8]
    strides: *id001
    trainable: true
- class_name: TimeDistributed
  config:
    layer:
      class_name: LSTM
      config: {U_regularizer: null, W_regularizer: null, activation: tanh, b_regularizer: null,
        consume_less: cpu, dropout_U: 0.0, dropout_W: 0.0, forget_bias_init: one,
        go_backwards: false, init: glorot_uniform, inner_activation: hard_sigmoid,
        inner_init: orthogonal, input_dim: 16, input_length: null, name: lstm_1, output_dim: 64,
        return_sequences: false, stateful: false, trainable: true, unroll: false}
    name: timedistributed_1
    trainable: true
- class_name: Flatten
  config: {name: flatten_1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_1, output_dim: 256, trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_1, trainable: true}
- class_name: Dropout
  config: {name: dropout_1, p: 0.75, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_2, output_dim: 64, trainable: true}
- class_name: Dropout
  config: {name: dropout_2, p: 0.75, trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_2, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_3, output_dim: 11, trainable: true}
- class_name: Activation
  config: {activation: softmax, name: activation_3, trainable: true}
